core/app/Http/Controllers/SiteController.php

    public function index(){
        $count = Page::where('tempname',$this->activeTemplate)->where('slug','home')->count();
        if($count == 0){
            $page = new Page();
            $page->tempname = $this->activeTemplate;
            $page->name = 'HOME';
            $page->slug = 'home';
            $page->save();
        }

        $data['page_title'] = 'Home';
        $data['sections'] = Page::where('tempname',$this->activeTemplate)->where('slug','home')->firstOrFail();
---
select count(*) as aggregate from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home'
select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'home' limit 1